HopeFOAM-0.1/tutorials/combustion/fireFoam/les/flameSpreadWaterSuppressionPanel/0/p
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{

    outlet
    {
        type            calculated;
        value           $internalField;
    }

    ground
    {
        type            calculated;
        value           $internalField;
    }

    side
    {
        type            calculated;
        value           $internalField;
    }

    inlet
    {
        type            calculated;
        value           $internalField;
    }
    region0_to_pyrolysisRegion_coupledWall
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
